docs/part2.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>hledger-makeitso Step-By-Step</title>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/beige.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">hledger-makeitso Step-By-Step</h1><p class="date">Created: 2018-09-30 Sun 21:00</p>
</section>
<section id="table-of-contents">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-org03e013a">Part 2</a></li>
<li><a href="#/slide-orged3738c">About This Document</a></li>
<li><a href="#/slide-org3ca9e80">An hledger report</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-org03e013a">
<h2 id="org03e013a">Part 2</h2>
<p>
This is the second part in a a series of step-by-step instructions.
</p>

<p>
They are intended to be read in sequence. Head over to the <a href="README.html">docs README</a> to see all parts.
</p>

</section>
</section>
<section>
<section id="slide-orged3738c">
<h2 id="orged3738c">About This Document</h2>
<p>
This document is a <a href="https://www.offerzen.com/blog/literate-programming-empower-your-writing-with-emacs-org-mode">literate</a> <a href="https://orgmode.org/worg/org-contrib/babel/intro.html">program</a>.
You can read it like a normal article, either <a href="https://github.com/apauley/hledger-makeitso/blob/master/docs/part2.org">on the web</a> or <a href="https://pauley.org.za/hledger-makeitso/part2.html">as a slide show</a>.
</p>

<p>
But you can also <a href="https://github.com/apauley/hledger-makeitso">clone the repository</a> and open <a href="https://raw.githubusercontent.com/apauley/hledger-makeitso/master/docs/part2.org">this org-mode file</a> in emacs.
Then you can execute each code snippet by pressing <code>C-c C-c</code> with your cursor on the relevant code block.
</p>

</section>
</section>
<section>
<section id="slide-org3ca9e80">
<h2 id="org3ca9e80">An hledger report</h2>
<p>
Now that we have <a href="part1.html">our first successful import</a>, can hledger show us some useful information?
</p>

<div class="org-src-container">

<pre  class="src src-sh" id="hledger-err-balance">hledger -f my-finances/makeitso.journal incomestatement
</pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre  class="src src-hledger">hledger: balance assertion error in
<span style="color: #2d9574;">"my-finances/import/gawie/bogart/cheque/3-journal/2016/123456789_2016-03-30.journal"</span>
(line 2, column 56):

in transaction:
<span style="color: #2d9574;">2016/03/01</span> * #Monthly Bank Fee//
    <span style="color: #7590db;">Assets:Current:Gawie:Bogart:Cheque</span>    R-500.00 = R40000.00
    <span style="color: #7590db;">expenses:unknown</span>                      R500.00
after posting:
    <span style="color: #7590db;">Assets:Current:Gawie:Bogart:Cheque</span>    R-500.00
balance assertion details:
date:       <span style="color: #2d9574;">2016/03/01</span>
account:    <span style="color: #7590db;">Assets:Current:Gawie:Bogart:Cheque</span>
commodity:  R
calculated: R-500.00
asserted:   R40000.00 (difference: +R40500.00)
</pre>
</div>

</section>
<section >

<p>
Not yet - we have a balance assertion error.
<code>hledger</code> thinks the balance should be <code>-R500</code>, but our import asserted that it should be <code>R40000</code>.
</p>

</section>
<section >

<p>
Remember the <code>balance</code> field we added to the rules file?
</p>
<div class="org-src-container">

<pre  class="src src-hledger" id="balance-field-rules-file">fields _, _, date, desc1, desc2, desc3, amount, balance, _
</pre>
</div>

<p>
It adds a balance assertion to each transaction, using the data helpfully provided by Bogart Bank.
</p>

</section>
<section >

<p>
Clearly the cheque account has a pre-existing balance of <code>R40500</code>.
To make <code>hledger</code> happy, we need to tell it what the opening balance for this account is:
</p>
<div class="org-src-container">

<pre  class="src src-hledger" id="bogart-cheque-opening-balance"><span style="color: #2d9574;">2016-03-01</span> Cheque Account Opening Balance
    <span style="color: #7590db;">Assets:Current:Gawie:Bogart:Cheque</span>              R40500
    <span style="color: #7590db;">Equity:Opening</span> Balances:Gawie:Bogart:Cheque
</pre>
</div>

<p>
Save this as <code>my-finances/import/gawie/bogart/cheque/opening.journal</code>.
</p>

</section>
<section >

<p>
Time for another git checkpoint.
</p>

<div class="org-src-container">

<pre  class="src src-sh" id="git-checkpoint-opening-balance"><span style="color: #4f97d7;">cd</span> my-finances/
git add .
git commit -m <span style="color: #2d9574;">'Added an opening balance for Bogart Cheque Account'</span>
<span style="color: #4f97d7;">cd</span> ..
</pre>
</div>

</section>
<section >

<p>
Now we can try the income statement again.
</p>

<div class="org-src-container">

<pre  class="src src-sh" id="hledger-incomestatement">hledger -f my-finances/makeitso.journal incomestatement <span style="color: #2d9574;">\</span>
  --pretty-tables
</pre>
</div>

</section>
<section >

<div class="org-src-container">

<pre  class="src src-org">Income Statement 2016/03/01-2016/03/25

                  &#9553; 2016/03/01-2016/03/25
&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9580;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;
 Revenues         &#9553;
&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9579;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;
 income:unknown   &#9553;             R37256.28
&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9579;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;
                  &#9553;             R37256.28
&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9580;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;
 Expenses         &#9553;
&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9579;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;
 expenses:unknown &#9553;             R36734.43
&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9579;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;
                  &#9553;             R36734.43
&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9580;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;
 Net:             &#9553;               R521.85

</pre>
</div>

<p>
It worked!
</p>

</section>
<section >

<p>
The story continues with <a href="part3.html">part 3</a>.
</p>
</section>
</section>
</div>
</div>
<script src="./reveal.js/lib/js/head.min.js"></script>
<script src="./reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: './reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: './reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
